Revit 2016 API
SchemaBuilder.SetVendorId Method
 Sets the id of the third-party vendor that may access entities of this Schema under the Vendor acess level, and to generally identify the owner of this Schema.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2012
Syntax
C#
public SchemaBuilder SetVendorId(
	string vendorId
)
Visual Basic
Public Function SetVendorId ( _
	vendorId As String _
) As SchemaBuilder
Visual C++
public:
SchemaBuilder^ SetVendorId(
	String^ vendorId
)
Parameters
vendorId
Type: System.String
 The vendor id.
Return Value
 The SchemaBuilder object may be used to add more settings.
Remarks
 The vendor id is the registered developer symbol. The registration interface is available at http://usa.autodesk.com/adsk/servlet/index?siteID=123112&id=1075006 Since vendor ids are not case sensitive, the string will be converted to upper case before it is stored in the schema.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The vendorId is invalid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  The SchemaBuilder has already finished building the Schema.
See Also
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace